{
  "commands": {
    "administration": {
      "moderationRole": {
        "messageError": [
          "You are not Administrator of this server, you can't use this command."
        ],
        "set": {
          "embed": {
            "titles": [
              "👔 Author:",
              "🎓 Role:",
              "📚 Privilege Granted:"
            ],
            "value": "AUTHOR just granted the moderation privilege."
          },
          "messageError": [
            "You must specify the role you want to give the moderation privilege. (role `id` or role `@mention`)",
            "The role you specified id not valid. please retry with a correct one.",
            "The role you specified already have the moderation privilege."
          ]
        },
        "remove": {
          "embed": {
            "titles": [
              "👔 Author:",
              "🎓 Role:",
              "📚 Privilege Removed:"
            ],
            "value": "AUTHOR just removed the moderation privilege."
          },
          "messageError": [
            "You must specify the role you want to remove the moderation privilege. (role `id` or role `@mention`)",
            "The role you specified id not valid. please retry with a correct one.",
            "The role you specified do not have the moderation privilege."
          ]
        },
        "help": {
          "embed": {
            "value": [
              "- Allows you to add moderation permissions to the specified role.",
              "- Useful to revoke the moderation permissions to the specified role."
            ]
          }
        }
      }
    },
    "moderation": {
      "clear": {
        "messageError": [
          "There is no role which have the moderation privilege. Please use the command role set.",
          "You are not moderators, you can't use this commands.",
          "You must specify the number of messages to delete.",
          "The number of messages to delete must be in the range of 1 < 100"
        ],
        "embed": {
          "description": "The clear is done master!",
          "title": [
            "Clear Author:",
            "Amount:"
          ],
          "value": [
            "Deleted"
          ]
        }
      },
      "mute": {
        "mute": {
          "noteMessage": [
            "Note: You can set a specific channel where restriction message will be send. \nTo do so use the command `PREFIXchannel set restriction`",
            "Note: The role ROLE has been created. You can now personalise it to you own preference."
          ],
          "messageError": [
            "You do not have the moderator privilege. You can't use that command.",
            "There is no role muted on the server.",
            "You must specified a user to mute.",
            "The user you specified is not valid. Please retry with a correct one.",
            "You can't mute yourself dickhead.",
            "The user you specified is already muted. you can't mute him again...",
            "You must specify a reason to mute someone.",
            "The reason cannot contain the letter ` LETTER `. Please retry without it!"
          ],
          "embed": {
            "description": "There is no role Muted on this Discord server. To create one, please react to this message.",
            "title": [
              "Staff Author:",
              "Muted User:",
              "Mute Duration:",
              "Mute Reason:"
            ]
          }
        },
        "tempmute": {

        },
        "unmute": {

        },
        "help": {

        }
      }
    }
  }
}
